; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-31)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at ball31 rooma)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 31
2. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 5 of 31
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 5 of 31
4. (drop ball9 rooma left)
   deleted: (carry ball9 left)
   added: (at ball9 rooma) (free left)
   goals met: 6 of 31
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 31
6. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 6 of 31
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 6 of 31
8. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 7 of 31
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 31
10. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 7 of 31
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 7 of 31
12. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 8 of 31
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 8 of 31
14. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 8 of 31
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 8 of 31
16. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 9 of 31
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 9 of 31
18. (pick ball15 roomb left)
   deleted: (at ball15 roomb) (free left)
   added: (carry ball15 left)
   goals met: 9 of 31
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 9 of 31
20. (drop ball15 rooma left)
   deleted: (carry ball15 left)
   added: (at ball15 rooma) (free left)
   goals met: 10 of 31
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 31
22. (pick ball14 roomb left)
   deleted: (at ball14 roomb) (free left)
   added: (carry ball14 left)
   goals met: 10 of 31
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 31
24. (drop ball14 rooma left)
   deleted: (carry ball14 left)
   added: (at ball14 rooma) (free left)
   goals met: 11 of 31
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 31
26. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 11 of 31
27. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 31
28. (drop ball13 rooma left)
   deleted: (carry ball13 left)
   added: (at ball13 rooma) (free left)
   goals met: 12 of 31
29. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 31
30. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 12 of 31
31. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 31
32. (drop ball12 rooma left)
   deleted: (carry ball12 left)
   added: (at ball12 rooma) (free left)
   goals met: 13 of 31
33. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 31
34. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 13 of 31
35. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 31
36. (drop ball11 rooma left)
   deleted: (carry ball11 left)
   added: (at ball11 rooma) (free left)
   goals met: 14 of 31
37. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 31
38. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 14 of 31
39. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 14 of 31
40. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 14 of 31
41. (drop ball10 rooma left)
   deleted: (carry ball10 left)
   added: (at ball10 rooma) (free left)
   goals met: 15 of 31
42. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 15 of 31
43. (pick ball31 room4 left)
   deleted: (at ball31 room4) (free left)
   added: (carry ball31 left)
   goals met: 15 of 31
44. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 15 of 31
45. (drop ball31 rooma left)
   deleted: (carry ball31 left)
   added: (at ball31 rooma) (free left)
   goals met: 16 of 31
46. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 16 of 31
47. (pick ball30 room4 left)
   deleted: (at ball30 room4) (free left)
   added: (carry ball30 left)
   goals met: 16 of 31
48. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 16 of 31
49. (drop ball30 rooma left)
   deleted: (carry ball30 left)
   added: (at ball30 rooma) (free left)
   goals met: 17 of 31
50. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 17 of 31
51. (pick ball29 room4 left)
   deleted: (at ball29 room4) (free left)
   added: (carry ball29 left)
   goals met: 17 of 31
52. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 17 of 31
53. (drop ball29 rooma left)
   deleted: (carry ball29 left)
   added: (at ball29 rooma) (free left)
   goals met: 18 of 31
54. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 18 of 31
55. (pick ball28 room4 left)
   deleted: (at ball28 room4) (free left)
   added: (carry ball28 left)
   goals met: 18 of 31
56. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 18 of 31
57. (drop ball28 rooma left)
   deleted: (carry ball28 left)
   added: (at ball28 rooma) (free left)
   goals met: 19 of 31
58. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 19 of 31
59. (pick ball27 room4 left)
   deleted: (at ball27 room4) (free left)
   added: (carry ball27 left)
   goals met: 19 of 31
60. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 19 of 31
61. (drop ball27 rooma left)
   deleted: (carry ball27 left)
   added: (at ball27 rooma) (free left)
   goals met: 20 of 31
62. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 20 of 31
63. (pick ball26 room4 left)
   deleted: (at ball26 room4) (free left)
   added: (carry ball26 left)
   goals met: 20 of 31
64. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 20 of 31
65. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 20 of 31
66. (drop ball26 rooma left)
   deleted: (carry ball26 left)
   added: (at ball26 rooma) (free left)
   goals met: 21 of 31
67. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 21 of 31
68. (pick ball25 room3 left)
   deleted: (at ball25 room3) (free left)
   added: (carry ball25 left)
   goals met: 21 of 31
69. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 21 of 31
70. (drop ball25 rooma left)
   deleted: (carry ball25 left)
   added: (at ball25 rooma) (free left)
   goals met: 22 of 31
71. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 22 of 31
72. (pick ball24 room3 left)
   deleted: (at ball24 room3) (free left)
   added: (carry ball24 left)
   goals met: 22 of 31
73. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 22 of 31
74. (drop ball24 rooma left)
   deleted: (carry ball24 left)
   added: (at ball24 rooma) (free left)
   goals met: 23 of 31
75. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 23 of 31
76. (pick ball23 room3 left)
   deleted: (at ball23 room3) (free left)
   added: (carry ball23 left)
   goals met: 23 of 31
77. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 23 of 31
78. (drop ball23 rooma left)
   deleted: (carry ball23 left)
   added: (at ball23 rooma) (free left)
   goals met: 24 of 31
79. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 24 of 31
80. (pick ball22 room3 left)
   deleted: (at ball22 room3) (free left)
   added: (carry ball22 left)
   goals met: 24 of 31
81. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 24 of 31
82. (drop ball22 rooma left)
   deleted: (carry ball22 left)
   added: (at ball22 rooma) (free left)
   goals met: 25 of 31
83. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 25 of 31
84. (pick ball21 room3 left)
   deleted: (at ball21 room3) (free left)
   added: (carry ball21 left)
   goals met: 25 of 31
85. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 25 of 31
86. (drop ball21 rooma left)
   deleted: (carry ball21 left)
   added: (at ball21 rooma) (free left)
   goals met: 26 of 31
87. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 26 of 31
88. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 26 of 31
89. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 26 of 31
90. (drop ball20 rooma left)
   deleted: (carry ball20 left)
   added: (at ball20 rooma) (free left)
   goals met: 27 of 31
91. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 27 of 31
92. (pick ball19 room3 left)
   deleted: (at ball19 room3) (free left)
   added: (carry ball19 left)
   goals met: 27 of 31
93. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 27 of 31
94. (drop ball19 rooma left)
   deleted: (carry ball19 left)
   added: (at ball19 rooma) (free left)
   goals met: 28 of 31
95. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 28 of 31
96. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 28 of 31
97. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 28 of 31
98. (drop ball18 rooma left)
   deleted: (carry ball18 left)
   added: (at ball18 rooma) (free left)
   goals met: 29 of 31
99. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 29 of 31
100. (pick ball17 room3 left)
   deleted: (at ball17 room3) (free left)
   added: (carry ball17 left)
   goals met: 29 of 31
101. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 29 of 31
102. (drop ball17 rooma left)
   deleted: (carry ball17 left)
   added: (at ball17 rooma) (free left)
   goals met: 30 of 31
103. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 30 of 31
104. (pick ball16 room3 left)
   deleted: (at ball16 room3) (free left)
   added: (carry ball16 left)
   goals met: 30 of 31
105. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 30 of 31
106. (drop ball16 rooma left)
   deleted: (carry ball16 left)
   added: (at ball16 rooma) (free left)
   goals met: 31 of 31
